dot_config/doom/config.org
#+TITLE: yasuke's Doom Emacs Config
#+AUTHOR: yasuke
#+DESCRIPTION: yasuke's personal Doom Emacs config.
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle config.el

* TABLE OF CONTENTS :toc:
- [[#about-this-config][ABOUT THIS CONFIG]]
- [[#bookmarks-and-buffers][BOOKMARKS AND BUFFERS]]
- [[#calendar][CALENDAR]]
- [[#centaur-tabs][CENTAUR-TABS]]
- [[#dashboard][DASHBOARD]]
  - [[#configuring-dashboard][Configuring Dashboard]]
  - [[#dashboard-in-emacsclient][Dashboard in Emacsclient]]
- [[#dired][DIRED]]
  - [[#keybindings-to-open-dired][Keybindings To Open Dired]]
  - [[#keybindings-within-dired][Keybindings Within Dired]]
  - [[#keybindings-within-dired-with-peep-dired-mode-enabled][Keybindings Within Dired With Peep-Dired-Mode Enabled]]
- [[#doom-theme][DOOM THEME]]
- [[#emojis][EMOJIS]]
- [[#elfeed][ELFEED]]
- [[#emms][EMMS]]
- [[#evaluate-elisp-expressions][EVALUATE ELISP EXPRESSIONS]]
- [[#eww][EWW]]
- [[#fonts][FONTS]]
- [[#ivy][IVY]]
  - [[#ivy-posframe][IVY-POSFRAME]]
  - [[#ivy-keybindings][IVY KEYBINDINGS]]
- [[#line-settings][LINE SETTINGS]]
- [[#mastodon][MASTODON]]
- [[#mouse-support][MOUSE SUPPORT]]
- [[#mu4e][MU4E]]
  - [[#setting-up-environment-with-main-account][Setting Up Environment With Main Account]]
  - [[#setting-up-multiple-accounts][Setting Up Multiple Accounts]]
  - [[#function-to-facilitate-switching-between-accounts][Function To Facilitate Switching Between Accounts]]
- [[#neotree][NEOTREE]]
- [[#open-specific-files][OPEN SPECIFIC FILES]]
- [[#org-mode][ORG MODE]]
- [[#password-store][PASSWORD STORE]]
- [[#registers][REGISTERS]]
- [[#remote-connections][REMOTE CONNECTIONS]]
- [[#shells][SHELLS]]
- [[#splits][SPLITS]]
- [[#winner-mode][WINNER MODE]]

* ABOUT THIS CONFIG 
This is my personal Doom Emacs config.  Doom Emacs is a distribution of Emacs that uses the "evil" keybindings (Vim keybindings) and includes a number of nice extensions and a bit of configuration out of the box.  I am maintaining this config not just for myself, but also for those that want to explore some of what is possible with Emacs.  I will add a lot of examples of plugins and settings, some of them I may not even use personally.  I do this because many people following me on YouTube look at my configs as "documentation".

* BOOKMARKS AND BUFFERS
Doom Emacs uses 'SPC b' for keybindings related to bookmarks and buffers.  Bookmarks are somewhat like registers in that they record positions you can jump to.  Unlike registers, they have long names, and they persist automatically from one Emacs session to the next. The prototypical use of bookmarks is to record where you were reading in various files.  Regarding /buffers/, the text you are editing in Emacs resides in an object called a /buffer/. Each time you visit a file, a buffer is used to hold the file’s text. Each time you invoke Dired, a buffer is used to hold the directory listing.

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks" "L" #'list-bookmarks
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+END_SRC

* CALENDAR
Let's make a 12-month calendar available.  Nice to have so that when we click on time/date in xmobar, we get a nice 12-month calendar to view.

This is a modification of: http://homepage3.nifty.com/oatu/emacs/calendar.html
See also: https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months

#+begin_src emacs-lisp
;; https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months
;; (defun dt/year-calendar (&optional year)
;;   (interactive)
;;   (require 'calendar)
;;   (let* (
;;       (current-year (number-to-string (nth 5 (decode-time (current-time)))))
;;       (month 0)
;;       (year (if year year (string-to-number (format-time-string "%Y" (current-time))))))
;;     (switch-to-buffer (get-buffer-create calendar-buffer))
;;     (when (not (eq major-mode 'calendar-mode))
;;       (calendar-mode))
;;     (setq displayed-month month)
;;     (setq displayed-year year)
;;     (setq buffer-read-only nil)
;;     (erase-buffer)
;;     ;; horizontal rows
;;     (dotimes (j 4)
;;       ;; vertical columns
;;       (dotimes (i 3)
;;         (calendar-generate-month
;;           (setq month (+ month 1))
;;           year
;;           ;; indentation / spacing between months
;;           (+ 5 (* 25 i))))
;;       (goto-char (point-max))
;;       (insert (make-string (- 10 (count-lines (point-min) (point-max))) ?\n))
;;       (widen)
;;       (goto-char (point-max))
;;       (narrow-to-region (point-max) (point-max)))
;;     (widen)
;;     (goto-char (point-min))
;;     (setq buffer-read-only t)))
;;
;; (defun dt/scroll-year-calendar-forward (&optional arg event)
;;   "Scroll the yearly calendar by year in a forward direction."
;;   (interactive (list (prefix-numeric-value current-prefix-arg)
;;                      last-nonmenu-event))
;;   (unless arg (setq arg 0))
;;   (save-selected-window
;;     (if (setq event (event-start event)) (select-window (posn-window event)))
;;     (unless (zerop arg)
;;       (let* (
;;               (year (+ displayed-year arg)))
;;         (dt/year-calendar year)))
;;     (goto-char (point-min))
;;     (run-hooks 'calendar-move-hook)))
;;
;; (defun dt/scroll-year-calendar-backward (&optional arg event)
;;   "Scroll the yearly calendar by year in a backward direction."
;;   (interactive (list (prefix-numeric-value current-prefix-arg)
;;                      last-nonmenu-event))
;;   (dt/scroll-year-calendar-forward (- (or arg 1)) event))
;;
;; (map! :leader
;;       :desc "Scroll year calendar backward" "<left>" #'dt/scroll-year-calendar-backward
;;       :desc "Scroll year calendar forward" "<right>" #'dt/scroll-year-calendar-forward)
;;
;; (defalias 'year-calendar 'dt/year-calendar)
;; #+end_src
;;
;; Let's also play around with calfw.
;; #+begin_src emacs-lisp
;; (use-package! calfw)
;; (use-package! calfw-org)
#+end_src

* CENTAUR-TABS
To use tabs in Doom Emacs, be sure to uncomment "tabs" in Doom's init.el.  Displays tabs at the top of the window similar to tabbed web browsers such as Firefox.  I don't actually use tabs in Emacs.  I placed this in my config to help others who may want tabs.  In the default configuration of Doom Emacs, 'SPC t' is used for "toggle" keybindings, so I choose 'SPC t c' to toggle centaur-tabs.  The "g" prefix for keybindings is used for a bunch of evil keybindings in Doom, but "g" plus the arrow keys were not used, so I thought I would bind those for tab navigation.  But I did leave the default "g t" and "g T" intact if you prefer to use those for centaur-tabs-forward/backward.

| COMMAND                     | DESCRIPTION               | KEYBINDING       |
|-----------------------------+---------------------------+------------------|
| centaur-tabs-mode           | /Toggle tabs globally/      | SPC t c          |
| centaur-tabs-local-mode     | /Toggle tabs local display/ | SPC t C          |
| centaur-tabs-forward        | /Next tab/                  | g <right> or g t |
| centaur-tabs-backward       | /Previous tab/              | g <left> or g T  |
| centaur-tabs-forward-group  | /Next tab group/            | g <down>         |
| centaur-tabs-backward-group | /Previous tab group/        | g <up>           |

#+BEGIN_SRC emacs-lisp
;;(setq centaur-tabs-set-bar 'over
;;      centaur-tabs-set-icons t
;;      centaur-tabs-gray-out-icons 'buffer
;;      centaur-tabs-height 24
;;      centaur-tabs-set-modified-marker t
;;      centaur-tabs-style "bar"
;;      centaur-tabs-modified-marker "•")
;;(map! :leader
;;      :desc "Toggle tabs globally" "t c" #'centaur-tabs-mode
;;      :desc "Toggle tabs local display" "t C" #'centaur-tabs-local-mode)
;;(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward        ; default Doom binding is 'g t'
;;                                               (kbd "g <left>")  'centaur-tabs-backward       ; default Doom binding is 'g T'
;;                                               (kbd "g <down>")  'centaur-tabs-forward-group
;;                                               (kbd "g <up>")    'centaur-tabs-backward-group)
#+END_SRC

* DASHBOARD
Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.

** Configuring Dashboard
#+begin_src emacs-lisp
;;(use-package dashboard
;;  :init      ;; tweak dashboard config before loading it
;;  (setq dashboard-set-heading-icons t)
;;  (setq dashboard-set-file-icons t)
;;  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
;;  (setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
;;  ;;(setq dashboard-startup-banner "~/.config/doom/doom-emacs-dash.png")  ;; use custom image as banner
;;  (setq dashboard-center-content nil) ;; set to 't' for centered content
;;  (setq dashboard-items '((recents . 5)
;;                          (agenda . 5 )
;;                          (bookmarks . 5)
;;                          (projects . 5)
;;                          (registers . 5)))
;;  :config
;;  (dashboard-setup-startup-hook)
;;  (dashboard-modify-heading-icons '((recents . "file-text")
;;			      (bookmarks . "book"))))
#+end_src

** Dashboard in Emacsclient
This setting ensures that emacsclient always opens on *dashboard* rather than *scratch*.
#+begin_src emacs-lisp
(setq doom-fallback-buffer "*dashboard*")
#+end_src

* DIRED
Dired is the file manager within Emacs.  Below, I setup keybindings for image previews (peep-dired).  Doom Emacs does not use 'SPC d' for any of its keybindings, so I've chosen the format of 'SPC d' plus 'key'.

** Keybindings To Open Dired
| COMMAND    | DESCRIPTION                        | KEYBINDING |
|------------+------------------------------------+------------|
| dired      | /Open dired file manager/            | SPC d d    |
| dired-jump | /Jump to current directory in dired/ | SPC d j    |

** Keybindings Within Dired
| COMMAND             | DESCRIPTION                                 | KEYBINDING |
|---------------------+---------------------------------------------+------------|
| dired-view-file     | /View file in dired/                          | SPC d v    |
| dired-up-directory  | /Go up in directory tree/                     | h          |
| dired-find-file     | /Go down in directory tree (or open if file)/ | l          |
| dired-next-line     | Move down to next line                      | j          |
| dired-previous-line | Move up to previous line                    | k          |
| dired-mark          | Mark file at point                          | m          |
| dired-unmark        | Unmark file at point                        | u          |

