.config/doom/config.el
(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks" "L" #'list-bookmarks
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))

;; https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months
;; (defun dt/year-calendar (&optional year)
;;   (interactive)
;;   (require 'calendar)
;;   (let* (
;;       (current-year (number-to-string (nth 5 (decode-time (current-time)))))
;;       (month 0)
;;       (year (if year year (string-to-number (format-time-string "%Y" (current-time))))))
;;     (switch-to-buffer (get-buffer-create calendar-buffer))
;;     (when (not (eq major-mode 'calendar-mode))
;;       (calendar-mode))
;;     (setq displayed-month month)
;;     (setq displayed-year year)
;;     (setq buffer-read-only nil)
;;     (erase-buffer)
;;     ;; horizontal rows
;;     (dotimes (j 4)
;;       ;; vertical columns
;;       (dotimes (i 3)
;;         (calendar-generate-month
;;           (setq month (+ month 1))
;;           year
;;           ;; indentation / spacing between months
;;           (+ 5 (* 25 i))))
;;       (goto-char (point-max))
;;       (insert (make-string (- 10 (count-lines (point-min) (point-max))) ?\n))
;;       (widen)
;;       (goto-char (point-max))
;;       (narrow-to-region (point-max) (point-max)))
;;     (widen)
;;     (goto-char (point-min))
;;     (setq buffer-read-only t)))
;;
;; (defun dt/scroll-year-calendar-forward (&optional arg event)
;;   "Scroll the yearly calendar by year in a forward direction."
;;   (interactive (list (prefix-numeric-value current-prefix-arg)
;;                      last-nonmenu-event))
;;   (unless arg (setq arg 0))
;;   (save-selected-window
;;     (if (setq event (event-start event)) (select-window (posn-window event)))
;;     (unless (zerop arg)
;;       (let* (
;;               (year (+ displayed-year arg)))
;;         (dt/year-calendar year)))
;;     (goto-char (point-min))
;;     (run-hooks 'calendar-move-hook)))
;;
;; (defun dt/scroll-year-calendar-backward (&optional arg event)
;;   "Scroll the yearly calendar by year in a backward direction."
;;   (interactive (list (prefix-numeric-value current-prefix-arg)
;;                      last-nonmenu-event))
;;   (dt/scroll-year-calendar-forward (- (or arg 1)) event))
;;
;; (map! :leader
;;       :desc "Scroll year calendar backward" "<left>" #'dt/scroll-year-calendar-backward
;;       :desc "Scroll year calendar forward" "<right>" #'dt/scroll-year-calendar-forward)
;;
;; (defalias 'year-calendar 'dt/year-calendar)
;; #+end_src
;;
;; Let's also play around with calfw.
;; #+begin_src emacs-lisp
;; (use-package! calfw)
;; (use-package! calfw-org)

;;(setq centaur-tabs-set-bar 'over
;;      centaur-tabs-set-icons t
;;      centaur-tabs-gray-out-icons 'buffer
;;      centaur-tabs-height 24
;;      centaur-tabs-set-modified-marker t
;;      centaur-tabs-style "bar"
;;      centaur-tabs-modified-marker "•")
;;(map! :leader
;;      :desc "Toggle tabs globally" "t c" #'centaur-tabs-mode
;;      :desc "Toggle tabs local display" "t C" #'centaur-tabs-local-mode)
;;(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward        ; default Doom binding is 'g t'
;;                                               (kbd "g <left>")  'centaur-tabs-backward       ; default Doom binding is 'g T'
;;                                               (kbd "g <down>")  'centaur-tabs-forward-group
;;                                               (kbd "g <up>")    'centaur-tabs-backward-group)

;;(use-package dashboard
;;  :init      ;; tweak dashboard config before loading it
;;  (setq dashboard-set-heading-icons t)
;;  (setq dashboard-set-file-icons t)
;;  (setq dashboard-banner-logo-title "Emacs Is More Than A Text Editor!")
;;  (setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
;;  ;;(setq dashboard-startup-banner "~/.config/doom/doom-emacs-dash.png")  ;; use custom image as banner
;;  (setq dashboard-center-content nil) ;; set to 't' for centered content
;;  (setq dashboard-items '((recents . 5)
;;                          (agenda . 5 )
;;                          (bookmarks . 5)
;;                          (projects . 5)
;;                          (registers . 5)))
;;  :config
;;  (dashboard-setup-startup-hook)
;;  (dashboard-modify-heading-icons '((recents . "file-text")
;;			      (bookmarks . "book"))))

(setq doom-fallback-buffer "*dashboard*")

;;(map! :leader
;;      (:prefix ("d" . "dired")
