dot_config/doom/config.org
** Keybindings Within Dired With Peep-Dired-Mode Enabled
| COMMAND              | DESCRIPTION                              | KEYBINDING |
|----------------------+------------------------------------------+------------|
| peep-dired           | /Toggle previews within dired/             | SPC d p    |
| peep-dired-next-file | /Move to next file in peep-dired-mode/     | j          |
| peep-dired-prev-file | /Move to previous file in peep-dired-mode/ | k          |

#+BEGIN_SRC emacs-lisp
;;(map! :leader
;;      (:prefix ("d" . "dired")
;;       :desc "Open dired" "d" #'dired
;;       :desc "Dired jump to current" "j" #'dired-jump)
;;      (:after dired
;;       (:map dired-mode-map
;;        :desc "Peep-dired image previews" "d p" #'peep-dired
;;        :desc "Dired view file" "d v" #'dired-view-file)))
;;;; Make 'h' and 'l' go back and forward in dired. Much faster to navigate the directory structure!
;;(evil-define-key 'normal dired-mode-map
;;  (kbd "M-RET") 'dired-display-file
;;  (kbd "h") 'dired-up-directory
;;  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
;;  (kbd "m") 'dired-mark
;;  (kbd "t") 'dired-toggle-marks
;;  (kbd "u") 'dired-unmark
;;  (kbd "C") 'dired-do-copy
;;  (kbd "D") 'dired-do-delete
;;  (kbd "J") 'dired-goto-file
;;  (kbd "M") 'dired-chmod
;;  (kbd "O") 'dired-chown
;;  (kbd "P") 'dired-do-print
;;  (kbd "R") 'dired-rename
;;  (kbd "T") 'dired-do-touch
;;  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
;;  (kbd "+") 'dired-create-directory
;;  (kbd "-") 'dired-up-directory
;;  (kbd "% l") 'dired-downcase
;;  (kbd "% u") 'dired-upcase
;;  (kbd "; d") 'epa-dired-do-decrypt
;;  (kbd "; e") 'epa-dired-do-encrypt)
;;;; If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'
;;(evil-define-key 'normal peep-dired-mode-map
;;  (kbd "j") 'peep-dired-next-file
;;  (kbd "k") 'peep-dired-prev-file)
;;(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;;;; Get file icons in dired
;;(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;;;; With dired-open plugin, you can launch external programs for certain extensions
;;;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
;;(setq dired-open-extensions '(("gif" . "sxiv")
;;                              ("jpg" . "sxiv")
;;                              ("png" . "sxiv")
;;                              ("mkv" . "mpv")
;;                              ("mp4" . "mpv")))
#+END_SRC

* DOOM THEME
Setting the theme to doom-one.  To try out new themes, I set a keybinding for counsel-load-theme with 'SPC h t'.

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-one)
(map! :leader
      :desc "Load new theme" "h t" #'counsel-load-theme)
#+END_SRC

* EMOJIS
Emojify is an Emacs extension to display emojis. It can display github style emojis like :smile: or plain ascii ones like :). 

#+begin_src emacs-lisp
(use-package emojify
  :hook (after-init . global-emojify-mode))
#+end_src

* ELFEED
An RSS newsfeed reader for Emacs.

#+BEGIN_SRC emacs-lisp
;; (use-package! elfeed-goodies)
;; (elfeed-goodies/setup)
;; (setq elfeed-goodies/entry-pane-size 0.5)
;; (add-hook 'elfeed-show-mode-hook 'visual-line-mode)
;; (evil-define-key 'normal elfeed-show-mode-map
;;   (kbd "J") 'elfeed-goodies/split-show-next
;;   (kbd "K") 'elfeed-goodies/split-show-prev)
;; (evil-define-key 'normal elfeed-search-mode-map
;;   (kbd "J") 'elfeed-goodies/split-show-next
;;   (kbd "K") 'elfeed-goodies/split-show-prev)
;; (setq elfeed-feeds (quote
;;                     (("https://www.reddit.com/r/linux.rss" reddit linux)
;;                      ("https://www.reddit.com/r/commandline.rss" reddit commandline)
;;                      ("https://www.reddit.com/r/distrotube.rss" reddit distrotube)
;;                      ("https://www.reddit.com/r/emacs.rss" reddit emacs)
;;                      ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
;;                      ("https://hackaday.com/blog/feed/" hackaday linux)
;;                      ("https://opensource.com/feed" opensource linux)
;;                      ("https://linux.softpedia.com/backend.xml" softpedia linux)
;;                      ("https://itsfoss.com/feed/" itsfoss linux)
;;                      ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
;;                      ("https://www.phoronix.com/rss.php" phoronix linux)
;;                      ("http://feeds.feedburner.com/d0od" omgubuntu linux)
;;                      ("https://www.computerworld.com/index.rss" computerworld linux)
;;                      ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
;;                      ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
;;                      ("https://betanews.com/feed" betanews linux)
;;                      ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
;;                      ("https://distrowatch.com/news/dwd.xml" distrowatch linux))))
#+END_SRC

* EMMS
One of the media players available for Emacs is emms, which stands for Emacs Multimedia System.  By default, Doom Emacs does not use 'SPC a',' so the format I use for these bindings is 'SPC a' plus 'key'.

| COMMAND               | DESCRIPTION                       | KEYBINDING |
|-----------------------+-----------------------------------+------------|
| emms-playlist-mode-go | /Switch to the playlist buffer/     | SPC a a    |
| emms-pause            | /Pause the track/                   | SPC a x    |
| emms-stop             | /Stop the track/                    | SPC a s    |
| emms-previous         | /Play previous track in playlist/   | SPC a p    |
| emms-next             | /Play next track in playlist/       | SPC a n    |

#+BEGIN_SRC emacs-lisp
;;(emms-all)
;;(emms-default-players)
;;(emms-mode-line 1)
;;(emms-playing-time 1)
;;(setq emms-source-file-default-directory "~/Music/Non-Classical/70s-80s/"
;;      emms-playlist-buffer-name "*Music*"
;;      emms-info-asynchronously t
;;      emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;;(map! :leader
;;      (:prefix ("z" . "EMMS audio player")
;;       :desc "Go to emms playlist" "a" #'emms-playlist-mode-go
;;       :desc "Emms pause track" "x" #'emms-pause
;;       :desc "Emms stop track" "s" #'emms-stop
;;       :desc "Emms play previous track" "p" #'emms-previous
;;       :desc "Emms play next track" "n" #'emms-next))
#+END_SRC

* EVALUATE ELISP EXPRESSIONS
Changing some keybindings from their defaults to better fit with Doom Emacs, and to avoid conflicts with my window managers which sometimes use the control key in their keybindings.  By default, Doom Emacs does not use 'SPC e' for anything, so I choose to use the format 'SPC e' plus 'key' for these (I also use 'SPC e' for 'eww' keybindings).

| COMMAND         | DESCRIPTION                                    | KEYBINDING |
|-----------------+------------------------------------------------+------------|
| eval-buffer     | /Evaluate elisp in buffer/                       | SPC e b    |
| eval-defun      | /Evaluate the defun containing or after point/   | SPC e d    |
| eval-expression | /Evaluate an elisp expression/                   | SPC e e    |
| eval-last-sexp  | /Evaluate elisp expression before point/         | SPC e l    |
| eval-region     | /Evaluate elisp in region/                       | SPC e r    |

#+Begin_src emacs-lisp
(map! :leader
      (:prefix ("e". "evaluate/EWW")
       :desc "Evaluate elisp in buffer" "b" #'eval-buffer
       :desc "Evaluate defun" "d" #'eval-defun
       :desc "Evaluate elisp expression" "e" #'eval-expression
       :desc "Evaluate last sexpression" "l" #'eval-last-sexp
       :desc "Evaluate elisp in region" "r" #'eval-region))
#+END_SRC

* EWW
EWW is the Emacs Web Wowser, the builtin browser in Emacs.  Below I set urls to open in a specific browser (eww) with browse-url-browser-function.  By default, Doom Emacs does not use 'SPC e' for anything, so I choose to use the format 'SPC e' plus 'key' for these (I also use 'SPC e' for 'eval' keybindings).  I chose to use 'SPC s w' for eww-search-words because Doom Emacs uses 'SPC s' for 'search' commands.

#+BEGIN_SRC emacs-lisp
;;(setq browse-url-browser-function 'eww-browse-url)
;;(map! :leader
;;      :desc "Search web for text between BEG/END"
;;      "s w" #'eww-search-words
;;      (:prefix ("e" . "evaluate/EWW")
;;       :desc "Eww web browser" "w" #'eww
;;       :desc "Eww reload page" "R" #'eww-reload))
#+END_SRC

* FONTS
Settings related to fonts within Doom Emacs:
+ 'doom-font' -- standard monospace font that is used for most things in Emacs.
+ 'doom-variable-pitch-font' -- variable font which is useful in some Emacs plugins.
+ 'doom-big-font' -- used in doom-big-font-mode; useful for presentations.
+ 'font-lock-comment-face' -- for comments.
+ 'font-lock-keyword-face' -- for keywords with special significance like 'setq' in elisp.
+ 'global-prettify-symbols-mode' -- change certain keywords to symbols, such as lambda!

#+BEGIN_SRC emacs-lisp
;;(setq doom-font (font-spec :family "Mononoki Nerd Font" :size 14)
;;      doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 14)
;;      doom-big-font (font-spec :family "Mononoki Nerd Font" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+END_SRC

* IVY
Ivy is a generic completion mechanism for Emacs.

