.config/doom/config.el
;;       :desc "Open dired" "d" #'dired
;;       :desc "Dired jump to current" "j" #'dired-jump)
;;      (:after dired
;;       (:map dired-mode-map
;;        :desc "Peep-dired image previews" "d p" #'peep-dired
;;        :desc "Dired view file" "d v" #'dired-view-file)))
;;;; Make 'h' and 'l' go back and forward in dired. Much faster to navigate the directory structure!
;;(evil-define-key 'normal dired-mode-map
;;  (kbd "M-RET") 'dired-display-file
;;  (kbd "h") 'dired-up-directory
;;  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
;;  (kbd "m") 'dired-mark
;;  (kbd "t") 'dired-toggle-marks
;;  (kbd "u") 'dired-unmark
;;  (kbd "C") 'dired-do-copy
;;  (kbd "D") 'dired-do-delete
;;  (kbd "J") 'dired-goto-file
;;  (kbd "M") 'dired-chmod
;;  (kbd "O") 'dired-chown
;;  (kbd "P") 'dired-do-print
;;  (kbd "R") 'dired-rename
;;  (kbd "T") 'dired-do-touch
;;  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
;;  (kbd "+") 'dired-create-directory
;;  (kbd "-") 'dired-up-directory
;;  (kbd "% l") 'dired-downcase
;;  (kbd "% u") 'dired-upcase
;;  (kbd "; d") 'epa-dired-do-decrypt
;;  (kbd "; e") 'epa-dired-do-encrypt)
;;;; If peep-dired is enabled, you will get image previews as you go up/down with 'j' and 'k'
;;(evil-define-key 'normal peep-dired-mode-map
;;  (kbd "j") 'peep-dired-next-file
;;  (kbd "k") 'peep-dired-prev-file)
;;(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;;;; Get file icons in dired
;;(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;;;; With dired-open plugin, you can launch external programs for certain extensions
;;;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
;;(setq dired-open-extensions '(("gif" . "sxiv")
;;                              ("jpg" . "sxiv")
;;                              ("png" . "sxiv")
;;                              ("mkv" . "mpv")
;;                              ("mp4" . "mpv")))

(setq doom-theme 'doom-one)
(map! :leader
      :desc "Load new theme" "h t" #'counsel-load-theme)

(use-package emojify
  :hook (after-init . global-emojify-mode))

;; (use-package! elfeed-goodies)
;; (elfeed-goodies/setup)
;; (setq elfeed-goodies/entry-pane-size 0.5)
;; (add-hook 'elfeed-show-mode-hook 'visual-line-mode)
;; (evil-define-key 'normal elfeed-show-mode-map
;;   (kbd "J") 'elfeed-goodies/split-show-next
;;   (kbd "K") 'elfeed-goodies/split-show-prev)
;; (evil-define-key 'normal elfeed-search-mode-map
;;   (kbd "J") 'elfeed-goodies/split-show-next
;;   (kbd "K") 'elfeed-goodies/split-show-prev)
;; (setq elfeed-feeds (quote
;;                     (("https://www.reddit.com/r/linux.rss" reddit linux)
;;                      ("https://www.reddit.com/r/commandline.rss" reddit commandline)
;;                      ("https://www.reddit.com/r/distrotube.rss" reddit distrotube)
;;                      ("https://www.reddit.com/r/emacs.rss" reddit emacs)
;;                      ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
;;                      ("https://hackaday.com/blog/feed/" hackaday linux)
;;                      ("https://opensource.com/feed" opensource linux)
;;                      ("https://linux.softpedia.com/backend.xml" softpedia linux)
;;                      ("https://itsfoss.com/feed/" itsfoss linux)
;;                      ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
;;                      ("https://www.phoronix.com/rss.php" phoronix linux)
;;                      ("http://feeds.feedburner.com/d0od" omgubuntu linux)
;;                      ("https://www.computerworld.com/index.rss" computerworld linux)
;;                      ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
;;                      ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
;;                      ("https://betanews.com/feed" betanews linux)
;;                      ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
;;                      ("https://distrowatch.com/news/dwd.xml" distrowatch linux))))

;;(emms-all)
;;(emms-default-players)
;;(emms-mode-line 1)
;;(emms-playing-time 1)
;;(setq emms-source-file-default-directory "~/Music/Non-Classical/70s-80s/"
;;      emms-playlist-buffer-name "*Music*"
;;      emms-info-asynchronously t
;;      emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
;;(map! :leader
;;      (:prefix ("z" . "EMMS audio player")
;;       :desc "Go to emms playlist" "a" #'emms-playlist-mode-go
;;       :desc "Emms pause track" "x" #'emms-pause
;;       :desc "Emms stop track" "s" #'emms-stop
;;       :desc "Emms play previous track" "p" #'emms-previous
;;       :desc "Emms play next track" "n" #'emms-next))

(map! :leader
      (:prefix ("e". "evaluate/EWW")
       :desc "Evaluate elisp in buffer" "b" #'eval-buffer
       :desc "Evaluate defun" "d" #'eval-defun
       :desc "Evaluate elisp expression" "e" #'eval-expression
       :desc "Evaluate last sexpression" "l" #'eval-last-sexp
       :desc "Evaluate elisp in region" "r" #'eval-region))

;;(setq browse-url-browser-function 'eww-browse-url)
;;(map! :leader
;;      :desc "Search web for text between BEG/END"
;;      "s w" #'eww-search-words
;;      (:prefix ("e" . "evaluate/EWW")
;;       :desc "Eww web browser" "w" #'eww
;;       :desc "Eww reload page" "R" #'eww-reload))

;;(setq doom-font (font-spec :family "Mononoki Nerd Font" :size 14)
;;      doom-variable-pitch-font (font-spec :family "Mononoki Nerd Font" :size 14)
;;      doom-big-font (font-spec :family "Mononoki Nerd Font" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
